app/controllers/comments_controller.rb

INSERT INTO "comments" ("instagram_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["instagram_id", 17], ["content", "コメントのテスト"], ["user_id", 2], ["created_at", "2018-01-28 03:55:14.965966"], ["updated_at", "2018-01-28 03:55:14.965966"]]
INSERT INTO "notifications" ("user_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["comment_id", 1], ["created_at", "2018-01-28 03:55:14.969603"], ["updated_at", "2018-01-28 03:55:14.969603"]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."read" = $2  [["user_id", 2], ["read", "f"]]
---
  def create
    # menuをパラメータの値から探し出し,menuに紐づくcommentsとしてbuildします。
    @comment = current_user.comments.build(comment_params)
    @menu = @comment.menu
    @notification = @comment.notifications.build(user_id: @menu.user.id )
    # クライアント要求に応じてフォーマットを変更
    respond_to do |format|
      if @comment.save
        format.html { redirect_to menu_path(@menu), notice: 'コメントを投稿しました。' }
        # JS形式でレスポンスを返します。
        format.js { render :index }

        unless @comment.menu.user_id == current_user.id
          Pusher.trigger("user_#{@comment.menu.user_id}_channel", 'comment_created', {
            message: 'あなたの投稿した画像にコメントが付きました'
          })
          Pusher.trigger("user_#{@comment.menu.user_id}_channel", 'notification_created', {
            unread_counts: Notification.where(user_id: @comment.menu.user.id, read: false).count
          })

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 11]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 11]]
---
  def destroy
    @comment = current_user.comments.find(params[:id])
    @menu = @comment.menu
    respond_to do |format|
      @comment.destroy