app/controllers/instagrams_controller.rb

SELECT "instagrams".* FROM "instagrams"
---
  def index
    @instagrams = Instagram.search(taste_params)

INSERT INTO "instagrams" ("content", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "りんご"], ["image", "Red_Apple.jpg"], ["user_id", 2], ["created_at", "2018-01-28 03:18:41.719408"], ["updated_at", "2018-01-28 03:18:41.719408"]]
---
  def create
    ##Instagram.create(instagrams_params)
    @Instagram = Instagram.new(instagrams_params)
    @Instagram.user_id = current_user.id
    if @Instagram.save

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "notifications" SET "read" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["read", "t"], ["updated_at", "2018-01-28 04:03:42.300972"], ["id", 7]]
---
  def show
    @comment = @Instagram.comments.build
    @comments = @Instagram.comments
    @taste = @Instagram.taste
    Notification.find(params[:notification_id]).update(read: true) if params[:notification_id]

DELETE FROM "instagrams" WHERE "instagrams"."id" = $1  [["id", 19]]
---
  def destroy
    #@Instagram = Instagram.find(params[:id])
    @Instagram.destroy

SELECT  "instagrams".* FROM "instagrams" WHERE "instagrams"."id" = $1 LIMIT 1  [["id", 20]]
---
   def set_Instagram
    @Instagram = Instagram.find(params[:id])