app/controllers/messages_controller.rb

  def index
  @messages = @conversation.messages
  if @messages.length > 10
---
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]

  def create
  @message = @conversation.messages.build(message_params)
    if @message.save
---
INSERT INTO "messages" ("body", "user_id", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "test"], ["user_id", 1], ["conversation_id", 1], ["created_at", "2018-01-28 06:27:25.609712"], ["updated_at", "2018-01-28 06:27:25.609712"]]