app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."read" = $2  ORDER BY "notifications"."created_at" DESC  [["user_id", 1], ["read", "f"]]
---
  def index
    @notifications = Notification.where(user_id: current_user.id).where(read: false).order(created_at: :desc)